#+TITLE:     Presentation of Scientific Results
#+AUTHOR:    Arnaud Legrand
#+DATE: Performance Evaluation Lecture
#+STARTUP: beamer overview indent
#+TAGS: noexport(n)
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [11pt,xcolor=dvipsnames,presentation]
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel-style-preembule.tex}

#+LaTeX: \input{org-babel-document-preembule.tex}


*** Why do we need to visualize ? The Anscombe's Quartet         :noexport:
#+begin_src R :results output :session :exports none
library(ggplot2)
library(plyr)
library(reshape)
anscombe$idx=1:length(anscombe$x1) 
a = melt(anscombe,id=c("idx"))
a$set=gsub("[^0-9]*","",as.character(a$variable))
a$variable=gsub("[0-9]*","",as.character(a$variable))
a = cast(a, idx+set~variable, mean) 
# library(ggplot2)
# library(dplyr)
# library(tidyr)
# anscombe$idx=1:length(anscombe$x1) 
# a = anscombe %>% gather(variable, value,-idx)
# a$set=gsub("[^0-9]*","",as.character(a$variable))
# a$variable=gsub("[0-9]*","",as.character(a$variable))
# a %>% spread(set,variable)
a = cast(a, idx+set~variable, mean) 
#+end_src

#+RESULTS:
: 
: Attachement du package : ‘reshape’
: 
: The following objects are masked from ‘package:plyr’:
: 
:     rename, round_any
: Erreur : Casting formula contains variables not found in molten data: variable

#+LaTeX: \begin{columns}\begin{column}{.4\linewidth}
#+begin_src R :results output :session :exports output
a1=a[a$set==1,c("x","y")]
a2=a[a$set==2,c("x","y")]
a1
#+end_src

#+RESULTS:
#+begin_example
    x     y
1  10  8.04
5   8  6.95
9  13  7.58
13  9  8.81
17 11  8.33
21 14  9.96
25  6  7.24
29  4  4.26
33 12 10.84
37  7  4.82
41  5  5.68
#+end_example

#+LaTeX: \end{column}\begin{column}{.6\linewidth}
#+begin_src R :results output :session :exports both
summary(a1)
summary(a2)
#+end_src

#+RESULTS:
#+begin_example
       x              y         
 Min.   : 4.0   Min.   : 4.260  
 1st Qu.: 6.5   1st Qu.: 6.315  
 Median : 9.0   Median : 7.580  
 Mean   : 9.0   Mean   : 7.501  
 3rd Qu.:11.5   3rd Qu.: 8.570  
 Max.   :14.0   Max.   :10.840
       x              y        
 Min.   : 4.0   Min.   :3.100  
 1st Qu.: 6.5   1st Qu.:6.695  
 Median : 9.0   Median :8.140  
 Mean   : 9.0   Mean   :7.501  
 3rd Qu.:11.5   3rd Qu.:8.950  
 Max.   :14.0   Max.   :9.260
#+end_example

#+LaTeX: \end{column}\end{columns}

*** plyr: Powerful One-liners
\small
#+BEGIN_SRC R :results output :exports both :session
library(plyr)
mtcars_summarized = ddply(mtcars,c("cyl","carb"), summarize, 
      num = length(wt), wt_mean = mean(wt), wt_sd = sd(wt),
      qsec_mean = mean(qsec), qsec_sd = sd(qsec));
mtcars_summarized
#+END_SRC

#+RESULTS:
#+begin_example
  cyl carb num  wt_mean     wt_sd qsec_mean   qsec_sd
1   4    1   5 2.151000 0.2627118  19.37800 0.6121029
2   4    2   6 2.398000 0.7485412  18.93667 2.2924368
3   6    1   2 3.337500 0.1732412  19.83000 0.5515433
4   6    4   4 3.093750 0.4131460  17.67000 1.1249296
5   6    6   1 2.770000        NA  15.50000        NA
6   8    2   4 3.560000 0.1939502  17.06000 0.1783255
7   8    3   3 3.860000 0.1835756  17.66667 0.3055050
8   8    4   6 4.433167 1.0171431  16.49500 1.4424112
9   8    8   1 3.570000        NA  14.60000        NA
#+end_example

*** dplyr
#+BEGIN_CENTER
  #+LaTeX: {\bf plyr next generation = dplyr}
#+END_CENTER

It's much much faster and more readable. The [[https://cran.rstudio.com/web/packages/dplyr/vignettes/introduction.html][/tutorial/]] is great...

#+begin_src R :results output :session :exports both
library(dplyr)
mtcars %>% group_by(cyl,carb) %>%
           select(wt,qsec) %>%
           summarise(num = n(),
       wt_mean = mean(wt), wt_sd = sd(wt),
       qsec_mean = mean(qsec), qsec_sd = sd(qsec)) %>%
           filter(num>=1)   
#+end_src

#+RESULTS:
#+begin_example
 Source: local data frame [9 x 7]
Groups: cyl

  cyl carb num  wt_mean     wt_sd qsec_mean   qsec_sd
1   4    1   5 2.151000 0.2627118  19.37800 0.6121029
2   4    2   6 2.398000 0.7485412  18.93667 2.2924368
3   6    1   2 3.337500 0.1732412  19.83000 0.5515433
4   6    4   4 3.093750 0.4131460  17.67000 1.1249296
5   6    6   1 2.770000        NA  15.50000        NA
6   8    2   4 3.560000 0.1939502  17.06000 0.1783255
7   8    3   3 3.860000 0.1835756  17.66667 0.3055050
8   8    4   6 4.433167 1.0171431  16.49500 1.4424112
9   8    8   1 3.570000        NA  14.60000        NA
#+end_example

*** "Messy" data
When using ggplot or plyr, your data may not in the right shape, in
which case you should *give a try to reshape/melt*

#+begin_src R :results output :session :exports both

#+end_src

#+RESULTS:

#+begin_src R :results output :session :exports both
messy <- data.frame(
  name = c("Wilbur", "Petunia", "Gregory"),
  a = c(67, 80, 64),
  b = c(56, 90, 50)
)
messy
#+end_src

#+RESULTS:
:      name  a  b
: 1  Wilbur 67 56
: 2 Petunia 80 90
: 3 Gregory 64 50

- =a= and =b= are two different types of drugs and the values correspond to
  heart rate
- ggplot faceting or coloring based on the drug type is a pain
- we need a way to make "wide" data longer
*** Reshape
#+begin_src R :results output :session :exports both
library(reshape)
cleaner = melt(messy,c("name"))
names(cleaner)=c("name","drug","heartrate")
cleaner
#+end_src

#+RESULTS:
:      name drug heartrate
: 1  Wilbur    a        67
: 2 Petunia    a        80
: 3 Gregory    a        64
: 4  Wilbur    b        56
: 5 Petunia    b        90
: 6 Gregory    b        50

*** Tidyr
Just like plyr, reshape is a little magical. tidyr is the new
generation (faster, more coherent). Again, the [[http://blog.rstudio.org/2014/07/22/introducing-tidyr/][/tutorial/]] is
great.

#+begin_src R :results output :session :exports both
library(tidyr)
library(dplyr)
messy %>% gather(drug, heartrate, -name)
#+end_src

#+RESULTS:
:      name drug heartrate
: 1  Wilbur    a        67
: 2 Petunia    a        80
: 3 Gregory    a        64
: 4  Wilbur    b        56
: 5 Petunia    b        90
: 6 Gregory    b        50

*Hint:* Avoid mixing old-generation with new-generation as it overrides
some function names and leads to weird behaviors
*** Summarizing information
You may like these *cheat sheets*: 
#+BEGIN_CENTER
https://www.rstudio.com/resources/cheatsheets/
#+END_CENTER

#+begin_src R :results output :session :exports both
df = read.csv("data/set1.csv",header=T)
# Alternatively: read.csv("https://raw.githubusercontent.com/
#            alegrand/SMPE/master/lectures/data/set1.csv")
head(df,n=2)
#+end_src

#+RESULTS:
:          A        B
: 1 7.256717 8.261171
: 2 3.813100 4.335301

Get the following summary using =plyr/reshape= or =dplyr/tydir=:
#+begin_src R :results output :session :exports results
dfgg = df %>% gather(Alternative, Time) 
dfsum = dfgg %>% 
       group_by(Alternative) %>%
       summarise(num = n(),
                 mean = mean(Time),
                 sd = sd(Time),
		       min = min(Time),
		       max = max(Time))
dfsum
#+end_src

#+RESULTS:
: Source: local data frame [2 x 6]
: 
:   Alternative num     mean       sd      min       max
: 1           A  40 4.903817 1.544423 2.400016  9.172525
: 2           B  40 5.783643 1.542987 3.539874 10.027147
*** I just got new Tees!
- A series of *measurements* (one value per measurement)
- *Nature* of the measurements
  - Factors (*nominal data*)
    #+begin_src R :results output :session :exports results
    set.seed(42);
    options(width=58);
    T_color = sample(size=20, 
        factor(c("Black","Red","Blue","White","Green")), 
        prob=c(.6,.1,.1,.1,.1),replace=T);
    T_color
    #+end_src

    #+RESULTS:
    :  [1] Red   Red   Black Green Blue  Black White Black Blue 
    : [10] White Black White Red   Black Black Red   Red   Black
    : [19] Black Black
    : Levels: Black Blue Green Red White

  - Ordered factors (*ordinal data*)
    #+begin_src R :results output :session :exports results
    options(width=55);
    sizes = c("S","M","L","XL");
    sizes = factor(sizes, levels=sizes, ordered=T)
    T_size = sample(size=20, sizes,
                    prob=c(.05,.75,.1,.05),replace=T);
    T_size
    #+end_src

    #+RESULTS:
    :  [1] XL M  S  XL M  M  M  XL M  L  M  L  M  M  M  L  M 
    : [18] M  XL M 
    : Levels: S < M < L < XL

  - Numbers (e.g., price, duration, \dots) (*numerical data*)
    #+begin_src R :results output :session :exports results
    options(width=58);
    T_price = round(10+rnorm(20,sd=3),digit=1);
    T_price
    #+end_src

    #+RESULTS:
    :  [1]  9.1  4.7  9.5 13.6 15.7  8.7  9.2  4.7 11.4  8.1
    : [11] 11.4 12.1 13.1  8.2 11.5  4.8  7.6  7.4  2.8 10.1

#+begin_src R :results output :session :exports both
str(T_size); # May want to use the str function
#+end_src

#+RESULTS:
:  Ord.factor w/ 4 levels "S"<"M"<"L"<"XL": 4 2 1 4 2 2 2 4 2 3 ...

*** Nominal Values
#+LaTeX: \begin{columns}\begin{column}{.6\linewidth}
- What is the *mode* (most frequent value)?
- Sort values according to their frequency...
  #+begin_src R :results output :session :exports both
  summary(T_color)
  #+end_src

  #+RESULTS:
  : Black  Blue Green   Red White 
  :    11     1     1     2     5

#+LaTeX: \end{column}\begin{column}{.4\linewidth}
  [[file:pdf_babel/ct_bar1.pdf]]

#+LaTeX: \end{column}\end{columns}\bigskip

\small
#+begin_src R :results output graphics :file pdf_babel/ct_bar1.pdf :exports code :width 4.5 :height 4 :session
col_freq=table(T_color);
T_color <- factor(T_color,
    levels = names(col_freq[order(col_freq, decreasing = TRUE)]));
plot(T_color);
#+end_src

#+RESULTS:
[[file:pdf_babel/ct_bar1.pdf]]

*** Ordinal Values
#+LaTeX: \begin{columns}\begin{column}{.5\linewidth}
- What is the *mode* (most frequent value)?
  #+begin_src R :results output :session :exports both
  summary(T_size)
  #+end_src

  #+RESULTS:
  :  S  M  L XL 
  :  1 17  1  1
- May still want to sort values according to their frequency...
- *Median*: not implemented in standard R for ordinal values, as it's
  not well defined

#+LaTeX: \end{column}\begin{column}{.5\linewidth}
  [[file:pdf_babel/ct_bar2.pdf]]

#+LaTeX: \end{column}\end{columns}

\small

#+begin_src R :results output :session :exports both
median(T_size)
library(DescTools)
median(T_size) # :(
#+end_src

#+RESULTS:
: Error in median.default(T_size) : requires numerical data
: [1] NA

#+begin_src R :results output graphics :file pdf_babel/ct_bar2.pdf :exports none :width 4.5 :height 4 :session
plot(T_size);
#+end_src

#+RESULTS:
[[file:pdf_babel/ct_bar2.pdf]]
*** Numerical Values
#+begin_src R :results output :session :exports both
str(T_price);
#+end_src

#+RESULTS:
:  num [1:20] 14.5 13.1 9.3 6.9 8.6 7.2 7.3 12.4 13.1 16 ...

#+begin_src R :results output :session :exports both
summary(T_price);
#+end_src

#+RESULTS:
:    Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
:   5.200   7.275   9.500   9.960  12.580  16.000

- =min=, =max=, =median= in R
- Median: 50% of values are smaller than 9.5\\\quad (a possible measure of *central tendency*)

*** Numerical Values
The *mode* and the *median* are measures of *central tendency* (typical
value)
- *Note*: There may be several modes and it depends on binning...

There is also the (arithmetic) *mean*: $A = \overline{x} = \frac{1}{N}\sum_{i=1}^N x_i$
#+begin_src R :results output :session :exports both
mean(T_price)
#+end_src

#+RESULTS:
: [1] 9.96

#+begin_src R :results output graphics :file pdf_babel/ct_hist.pdf :exports results :width 6 :height 3 :session
df = data.frame(x=rgamma(1000,shape=2));
bw = .5;

bks = hist(df$x,plot=F,breaks=ceiling(diff(range(df$x))/bw));
ibks = bks$counts==max(bks$counts)
Mode = mean(c(bks$breaks[c(ibks,F)], bks$breaks[c(F,ibks)]));

ct = rbind(data.frame(x=median(df$x), label="Median", y=.3),
           data.frame(x=mean(df$x), label="Mean", y=.2),
           data.frame(x=Mode, label="Mode", y=.4));

ggplot(df, aes(x=x, y=..density..)) + theme_bw() +
     geom_histogram(alpha=.3,color="black", fill="gray", binwidth=bw)  +
     geom_vline(data=ct, aes(xintercept=x,color=label),linetype = "longdash") +
     geom_text(data=ct, aes(x=x+.2,y=y,label=label,color=label),hjust=0) +
     scale_color_brewer(palette="Set1");
#+end_src

#+RESULTS:
[[file:pdf_babel/ct_hist.pdf]]

*** Quantile
#+begin_src R :results output :session :exports both
quantile(T_price,c(.05,.25,.5,.75,.95))
#+end_src

#+RESULTS:
:     5%    25%    50%    75%    95% 
:  4.605  7.550  9.150 11.425 13.705

Inter-Quantile Range:
- *Inter-quartile range*: $IQR = Q_{75}-Q_{25}$
- But other values are possible, e.g., $Q_{95}-Q_{5}$
- *Range*: $\max - \min$ (may grow unbounded)
  - $\leadsto$ quite difficult to use
*** Skewness
Could we illustrate this a bit? 
#+begin_src R :results output :session :exports both
library(moments)
skewness(runif(1000))
#+end_src

#+RESULTS:
: [1] 0.04626483

#+begin_src R :results output graphics :file pdf_babel/var_2.pdf :exports results :width 6 :height 4 :session
df_skew = function (x) {
  s=skewness(x);
  l=paste("Skewness = ",round(s,digits=3));
  data.frame(x=x,label=l);
}

df = rbind(df_skew(runif(1000,min=-3,max=3)),
           df_skew(rnorm(1000)),
           df_skew(rgamma(1000,shape=3)),
           df_skew(10-rgamma(1000,shape=3)));

ggplot(df,aes(x=x,y=..density..)) + theme_bw() +
    geom_histogram(fill="gray",color="black") + facet_wrap(~label);
#+end_src

#+BEGIN_CENTER
  #+ATTR_LaTeX: :width .8\linewidth
  #+RESULTS:
  [[file:pdf_babel/var_2.pdf]]
#+END_CENTER
*** Kurtosis
- peakedness (width of peak), tail weight, lack of shoulders...
- measure infrequent extreme deviations, as opposed to frequent
  modestly sized deviations

$$K = \frac{\tfrac{1}{n} \sum_{i=1}^n (x_i -
\overline{x})^4}{\Bigg[\underbrace{\tfrac{1}{n} \sum_{i=1}^n (x_i -
\overline{x})^2}_{\text{variance}}\Bigg]^2} - 3$$

The *-3* is here so that normal distribution have a Kurtosis of 0

#+begin_src R :results output :session :exports both
library(moments)
x = rnorm(1000) ; var(x);
kurtosis(x)-3
#+end_src

#+RESULTS:
: [1] 1.039743
: [1] 0.01825114

*** Classical information
#+begin_src R :results output :session :exports none
x = rgamma(100,shape=3)
dfx=data.frame(val=x);
#+end_src

#+RESULTS:

#+begin_src R :results output graphics :file pdf_babel/summary_1.pdf :exports results :width 6 :height 3 :session
gghist = function(x) {
  breaks=ceiling(log2(length(x)+1));
  bw = diff(range(x))/breaks;
  ggplot(data.frame(x=x),aes(x=x,y=..density..)) + theme_bw() +
      geom_histogram(fill="gray",color="black",binwidth=bw);
}
gghist(x);
#+end_src

#+RESULTS:
[[file:pdf_babel/summary_1.pdf]]

#+begin_src R :results output :session :exports both
summary(x)
var(x)
#+end_src

#+RESULTS:
:    Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
:  0.4065  1.8430  2.5020  2.8660  3.6310  7.0220
: [1] 2.117541
